{
  "intents": [
    {
      "tag": "allergies",
      "symptoms": [
        "sneezing",
        "runny nose",
        "red itchy watery eyes",
        "wheezing",
        "coughing",
        "rash",
        "asthma",
        "eczema"
      ],
      "treatment": [
        "antihistamines decongestants lotion and creams steroid apray drop cream inhalers for saftey please get professional advice from your Doctor"
      ]
    },
    {
      "tag": "alcohol related liver disease",
      "symptoms": [
        "feeling sick",
        "weight loss",
        "loss of appetite",
        "yellowing of the eyes and skin",
        "jaundice",
        "swelling in the ankles and tummy",
        "confusion or drowsiness",
        "vomiting blood or passing blood in your stools"
      ],
      "treatment": [
        "There's currently no specific medical treatment for ARLD. The main treatment is to stop drinking, preferably for the rest of your life. This reduces the risk of further damage to your liver and gives it the best chance of recovering. A liver transplant may be required in severe cases where the liver has stopped functioning and doesn't improve when you stop drinking alcohol."
      ]
    },
    {
      "tag": "appendicitis",
      "symptoms": [
        "pain in the middle of your tummy that comes and goes",
        "loss of appetite",
        "nausea and vomiting",
        "high temperature (fever)",
        "constipation or diarrhoea",
        "painful urination",
        "painful sneezing or coughing",
        "sharp pain when you press on your tummy",
        "swelling and bloating of your abdomen"
      ],
      "treatment": [
        "In most cases of appendicitis, the appendix needs to be surgically removed as soon as possible."
      ]
    },
    {
      "tag": "arthritis",
      "symptoms": [
        "joint pain",
        "joint tenderness and stiffness",
        "inflammation in and around the joints",
        "restricted movement of the joints",
        "warm and red skin over the affected joint",
        "weakness and muscle wasting",
        "joint swelling",
        "morning stiffness that lasts for more than an hour",
        "fatigue",
        "weight loss"
      ],
      "treatment": [
        "There's no cure for arthritis, but there are many treatments that can help slow down the condition. painkillers arthroplasty (joint replacement) arthodesis (joint fusion)"
      ]
    },
    {
      "tag": "bronchiectasis",
      "symptoms": [
        "persistent cough that brings up phlegm or sputum",
        "shortness of breath",
        "chest pain",
        "wheezing",
        "fatigue",
        "frequent lung infections",
        "coughing up blood",
        "weight loss",
        "clubbing of the fingers (enlarged fingertips)",
        "crackles or wheezing sounds in the chest"
      ],
      "treatment": [
        "exercises and special devices to help you clear mucus out of your lungs. medication to help improve airflow wit the lungs. antibiotics to treat any lung infecti that develop"
      ]
    },
    {
      "tag": "common_cold",
      "symptoms": [
        "sore throat",
        "blocked or runny nose",
        "sneezing",
        "cough",
        "headache",
        "fatigue",
        "muscle aches",
        "watery eyes",
        "low-grade fever",
        "loss of appetite"
      ],
      "treatment": [
        "esting, drinking plenty of fluids and eating healthily. taking over-the-counter painkillers, such as paracetamol or ibuprofen, to reduce any fever or discomfort.using decongestant sprays or tablets to relieve a blocked nose.trying remedies such as gargling salt water and sucking on menthol sweets.\n if your symptoms persist for more than three weeks please seek for professional advise"
      ]
    },
    {
      "tag": "constipation",
      "symptoms": [
        "infrequent bowel movements",
        "difficulty passing stool",
        "abdominal discomfort",
        "bloating",
        "straining during bowel movements",
        "hard or lumpy stools",
        "feeling of incomplete evacuation"
      ],
      "treatment": [
        "Diet and lifestyle changes are usually recommended as the first treatment for constipation.This includes gradually increasing your daily intake of fibre, making sure you drink plenty of fluids, and trying to get more exercise.If these aren't effective, your pharmacist may recommend an oral laxative medication that can help you empty your bowels."
      ]
    },
    {
      "tag": "covid-19",
      "symptoms": [
        "fever",
        "dry cough",
        "tiredness",
        "aches and pains",
        "sore throat",
        "diarrhoea",
        "conjunctivitis",
        "headache",
        "loss of taste or smell",
        "skin rash or discoloration of fingers/toes",
        "difficulty breathing or shortness of breath",
        "chest pain or pressure",
        "loss of speech or movement"
      ],
      "treatment": [
        "Isolate yourself in a well ventilated room.Use a triple layer medical mask, discard mask after 8 hours of use or earlier if they become wet or visibly soiled. In the event of a caregiver entering the room, both caregiver and patient may consider using N 95 mask.Take rest and drink a lot of fluids to maintain adequate hydration.Frequent hand washing with soap and water for at least 40 seconds or clean with alcohol-based sanitizer.\n\n take prescribed doses of vaccine.\n\n STAY HOME, STAY SAFE "
      ]
    },
    {
      "tag": "flu",
      "symptoms": [
        "high temperature (fever)",
        "tiredness and weakness",
        "headache",
        "general aches and pains",
        "dry chesty cough",
        "sore throat"
      ],
      "treatment": [
        "Rest, stay hydrated, and manage symptoms with over-the-counter medications like paracetamol or ibuprofen. Antiviral medication may be prescribed. Avoid spreading the flu by covering your mouth and nose when sneezing or coughing, and maintaining good hand hygiene."
      ]
    },
    {
      "tag": "heart_failure",
      "symptoms": [
        "Breathlessness",
        "Tiredness and lethargy",
        "Leg swelling",
        "Loss of appetite",
        "Cough and a frothy spit"
      ],
      "treatment": [
        "Immediate medical attention is needed. Treatment may involve medications to manage symptoms, lifestyle changes such as dietary adjustments and exercise, and in some cases, medical procedures or surgery."
      ]
    },
    {
      "tag": "kidney_stones",
      "symptoms": [
        "Severe pain in the abdomen",
        "Urinary tract infection",
        "Ache in the lower back",
        "Periods of intense pain in the back or side of your abdomen",
        "Feeling restless and unable to lie still",
        "Nausea",
        "Needing to urinate more often than normal",
        "Pain when you urinate",
        "Blood in your urine"
      ],
      "treatment": [
        "Treatment depends on the size and location of the kidney stone. Small stones may pass on their own with plenty of fluids. Larger stones may require medical intervention, such as shock wave lithotripsy, ureteroscopy, or surgical removal."
      ]
    },
    {
      "tag": "kidney_infection",
      "symptoms": [
        "Pain and discomfort in your side, lower back, or around your genitals",
        "High temperature (fever) that may reach 39.5°C (103.1°F)",
        "Shivering or chills",
        "Feeling very weak or tired",
        "Loss of appetite",
        "Feeling sick or being sick"
      ],
      "treatment": [
        "Kidney infections are typically treated with antibiotics to eliminate the bacterial infection. Pain relievers may also be recommended to manage discomfort."
      ]
    },
    {
      "tag": "lyme_disease",
      "symptoms": [
        "Tiredness and fatigue",
        "Muscle pain",
        "Joint pain",
        "Headaches",
        "High temperature (fever)",
        "Chills",
        "Neck stiffness",
        "Swelling and pain in the joints",
        "Nerve problems such as numbness or pain in limbs",
        "Memory problems",
        "Difficulty concentrating",
        "Heart problems"
      ],
      "treatment": [
        "Lyme disease is typically treated with antibiotics. Early diagnosis and treatment are important to prevent more severe complications."
      ]
    },
    {
      "tag": "malaria",
      "symptoms": [
        "High temperature (fever)",
        "Headache",
        "Sweats and chills",
        "Vomiting",
        "Muscle pains",
        "Diarrhoea",
        "Feeling generally unwell"
      ],
      "treatment": [
        "Malaria is treated with antimalarial medications. The choice of medication depends on the type of malaria and the severity of the symptoms."
      ]
    },
    {
      "tag": "nosebleed",
      "symptoms": [
        "continous nose bleeding"
      ],
      "treatment": [
        "sit down and firmly pinch the soft part of your nose just above your nostril for at least 10-15 minutes,lean forward and breathe through your mouth – this will drain blood into your nose instead of down the back of your throat,place an ice pack or bag of frozen vegetables covered by a towel on the bridge of your nose,stay upright rather than lying down as this reduces the blood pressure in the blood vessels of your nose and will discourage further bleeding"
      ]
    },
    {
      "tag": "obesity",
      "symptoms": [
        "Excessive body weight",
        "Difficulty in sleeping",
        "Back or joint pain",
        "Excessive sweating",
        "Intolerance to heat",
        "Infections in skin folds",
        "Fatigue",
        "Depression"
      ],
      "treatment": [
        "Treatment for obesity involves a combination of diet, exercise, lifestyle changes, and in some cases, medication or surgical interventions"
      ]
    },
    {
      "tag": "oral_thrush_in_adults",
      "symptoms": [
        "White patches or plaques in the mouth",
        "Patches that can be wiped off, leaving behind red areas that may bleed slightly",
        "Loss of taste or an unpleasant taste in the mouth",
        "Redness inside the mouth and throat",
        "Cracks at the corners of the mouth",
        "Painful burning sensation in the mouth"
      ],
      "treatment": [
        "Oral thrush in adults is typically treated with antifungal medicines to eliminate the fungal infection."
      ]
    },
    {
      "tag": "sunburn",
      "symptoms": [
        "skin damage by uv rays blistering or swelling of the skin oedema chills a high temperature fever of 38C 100.4F or above or 37.5C 99.5F or above in children under five dizziness headaches and feeling sick symptoms of heat exhaustion"
      ],
      "treatment": [
        "suitable clothing,sunscreen"
      ]
    },
    {
      "tag": "tooth decay",
      "symptoms": [
        "toothache either continuous pain keeping you awake or occasional sharp pain without an obvious cause tooth sensitivity you may feel tenderness or pain when eating or drinking something hot cold or sweet grey brown or black spots appearing on your teeth bad breath an unpleasant taste in your mouth"
      ],
      "treatment": [
        "visit your dentist regularly ,cut down on sugary and starchy food and drinks, particularly between meals or within an hour of going to bed,look after your teeth and gums,avoid smoking or drinking alcohol excessively ,see your dentist or GP if you have a persistently dry mouth"
      ]
    },
    {
      "tag": "tonsillitis",
      "symptoms": [
        "Sore throat",
        "Swollen and red tonsils",
        "Painful swallowing",
        "Fever over 38°C (100.4°F)",
        "Coughing",
        "Headache",
        "Earache",
        "Feeling sick or being sick",
        "Loss of voice or changes to your voice"
      ],
      "treatment": [
        "Over-the-counter painkillers such as paracetamol and ibuprofen can help relieve painful symptoms. If symptoms persist or worsen, consult a healthcare professional."
      ]
    },
    {
      "tag": "tuberculosis (TB)",
      "symptoms": [
        "Persistent cough that lasts for more than three weeks",
        "Coughing up blood or sputum",
        "Feeling tired and weak",
        "Weight loss",
        "Loss of appetite",
        "High temperature (fever)",
        "Night sweats",
        "Shortness of breath or chest pain"
      ],
      "treatment": [
        "Treatment for tuberculosis (TB) usually involves a long course of antibiotics lasting several months. Early diagnosis and proper medical care are crucial for effective treatment."
      ]
    },
    {
      "tag": "tooth decay",
      "symptoms": [
        "Grey, brown, or black spots appearing on your teeth",
        "Toothache, either continuous pain or occasional sharp pain",
        "Tooth sensitivity, especially to hot, cold, or sweet foods",
        "Bad breath and an unpleasant taste in your mouth"
      ],
      "treatment": [
        "Tooth decay can be prevented through good oral hygiene practices such as regular brushing, flossing, and avoiding sugary foods and drinks. If decay has already occurred, treatment may involve dental fillings, crowns, or other procedures depending on the severity of the damage."
      ]
    },
    {
      "tag": "tinnitus",
      "symptoms": [
        "Perception of buzzing, humming, grinding, hissing, or whistling sounds in the ears",
        "Sounds may be continuous or intermittent",
        "May be accompanied by hearing loss or dizziness"
      ],
      "treatment": [
        "Treatment for tinnitus depends on the underlying cause. It can include sound therapy, counseling, cognitive behavioral therapy (CBT), and tinnitus retraining therapy (TRT). In some cases, addressing related conditions such as hearing loss or earwax buildup may alleviate tinnitus symptoms."
      ]
    },
    {
      "tag": "ulcerative_colitis",
      "symptoms": [
        "Recurring diarrhea containing blood, mucus, or pus",
        "Abdominal pain and cramping",
        "Frequent need to empty the bowels",
        "Fatigue and weakness"
      ],
      "treatment": [
        "Treatment for ulcerative colitis may involve medication such as aminosalicylates (ASAs), corticosteroids, and immunosuppressants to reduce inflammation and manage symptoms.",
        "In severe cases, surgery to remove the colon and rectum (proctocolectomy) may be considered.",
        "Dietary changes and lifestyle modifications can also play a role in managing symptoms and promoting remission."
      ]
    },
    {
      "tag": "underactive_thyroid",
      "symptoms": [
        "Fatigue and tiredness",
        "Feeling sensitive to cold",
        "Unexplained weight gain",
        "Constipation",
        "Depression",
        "Slow movements and thoughts",
        "Muscle aches and weakness",
        "Dry and scaly skin",
        "Brittle hair and nails",
        "Irregular or heavy periods"
      ],
      "treatment": [
        "Underactive thyroid, also known as hypothyroidism, is typically treated with hormone replacement therapy using medications like levothyroxine.",
        "Regular monitoring of thyroid hormone levels is important to ensure effective treatment.",
        "Lifestyle changes such as maintaining a healthy diet, staying physically active, and managing stress can also contribute to managing the condition."
      ]
    },
    {
      "tag": "urticaria",
      "symptoms": [
        "Itchy rash on the skin",
        "Rash may appear in one part of the body or spread across large areas"
      ],
      "treatment": [
        "Antihistamines can help relieve discomfort and itching associated with urticaria.",
        "Identifying and avoiding triggers that cause urticaria outbreaks is important.",
        "In severe cases, a doctor may recommend other medications or treatments to manage symptoms."
      ]
    },
    {
      "tag": "urinary_tract_infection",
      "symptoms": [
        "High temperature (fever) of 38°C (100.4°F) or above",
        "Pain in your sides or back",
        "Shivering and chills",
        "Feeling and being sick",
        "Confusion, agitation, or restlessness"
      ],
      "treatment": [
        "Over-the-counter painkillers such as paracetamol can help with pain.",
        "Drinking plenty of fluids may also help alleviate symptoms.",
        "Antibiotics are commonly prescribed to treat urinary tract infections.",
        "If symptoms persist or worsen, it's important to consult a healthcare professional."
      ]
    },
    {
      "tag": "varicose_eczema",
      "symptoms": [
        "Itchy, red, and swollen skin",
        "Dry and flaky skin",
        "Scaly or crusty skin"
      ],
      "treatment": [
        "Long-term treatment with a combination of:",
        "- Emollients (moisturizers) to keep the skin hydrated.",
        "- Topical corticosteroids to reduce inflammation and itching.",
        "- Compression stockings to improve blood circulation in the affected area.",
        "Consult a healthcare professional for proper diagnosis and treatment."
      ]
    },
    {
      "tag": "varicose_veins",
      "symptoms": [
        "Aching, heavy, and uncomfortable legs",
        "Swollen feet and ankles",
        "Burning or throbbing in your legs",
        "Muscle cramps in your legs, particularly at night",
        "Dry, itchy, and thin skin over the affected vein"
      ],
      "treatment": [
        "Taking regular exercise to improve blood circulation.",
        "Avoiding standing up for long periods to reduce pressure on the veins.",
        "Elevating the affected area when resting to reduce swelling.",
        "Wearing compression stockings to improve blood flow and reduce symptoms.",
        "Consult a healthcare professional for proper diagnosis and treatment."
      ]
    },
    {
      "tag": "venous_leg_ulcer",
      "symptoms": [
        "A heavy feeling in your legs",
        "Swollen ankles (oedema)",
        "Aching or swelling in your legs",
        "Red, flaky, scaly, and itchy skin on your legs",
        "Enlarged veins on your legs (varicose veins)",
        "An unpleasant and foul-smelling discharge from the ulcer"
      ],
      "treatment": [
        "Treatment should always be carried out by a healthcare professional trained in compression therapy for leg ulcers.",
        "Wearing compression stockings to improve blood flow and reduce swelling.",
        "Cleaning and dressing the ulcer regularly to promote healing.",
        "Elevating the affected leg when resting to reduce swelling.",
        "Consult a healthcare professional for proper diagnosis and treatment."
      ]
    },
    {
      "tag": "whooping_cough",
      "symptoms": [
        "Runny nose",
        "Red and watery eyes",
        "A sore throat",
        "A slightly raised temperature"
      ],
      "treatment": [
        "Drink lots of fluids.",
        "Clean away mucus and sick from your or your child's mouth.",
        "Take painkillers such as paracetamol or ibuprofen for a fever.",
        "Consult a healthcare professional for proper diagnosis and treatment."
      ]
    },
    {
      "tag": "yellow_fever",
      "symptoms": [
        "High temperature (fever)",
        "A headache",
        "Nausea or vomiting",
        "Muscle pain, including backache",
        "Loss of appetite"
      ],
      "treatment": [
        "There is no specific treatment for yellow fever.",
        "Supportive care includes rest, hydration, and pain relievers.",
        "Vaccination is available to prevent yellow fever.",
        "Consult a healthcare professional for more information and guidance."
      ]
    }
  ]
}