{
  "intents": [
    {
      "tag": "allergies",
      "symptoms": [
        "sneezing runny nose red itchy watery eyes wheezing coughing rash asthema eczema"
      ],
      "treatment": [
        "antihistamines decongestants lotion and creams steroid apray drop cream inhalers for saftey please get professional advice from your Doctor"
      ]
    },
    {
      "tag": "alcohol related liver disease",
      "symptoms": [
        "feeling sick weight loss loss of appetite yellowing of the eyes and skin jaundice swelling in the ankles and tummy confusion or drowsiness vomiting blood or passing blood in your stools"
      ],
      "treatment": [
        "There's currently no specific medical treatment for ARLD. The main treatment is to stop drinking, preferably for the rest of your life. This reduces the risk of further damage to your liver and gives it the best chance of recovering. A liver transplant may be required in severe cases where the liver has stopped functioning and doesn't improve when you stop drinking alcohol."
      ]
    },
    {
      "tag": "appendicitis",
      "symptoms": [
        "pain in the middle of your tummy abdomen that come and go lose your appetite"
      ],
      "treatment": [
        "In most cases of appendicitis, the appendix needs to be surgically removed as soon as possible."
      ]
    },
    {
      "tag": "arthritis",
      "symptoms": [
        "joint pain tenderness and stiffness inflammation in and around the joints restricted movement of the joints warm red skin over the affected joint weakness and muscle wasting"
      ],
      "treatment": [
        "There's no cure for arthritis, but there are many treatments that can help slow down the condition. painkillers arthroplasty (joint replacement) arthodesis (joint fusion)"
      ]
    },
    {
      "tag": "bipolar_disorder",
      "symptoms": [
        "depression feeling very low and feeling very high and overactive simple mood swings"
      ],
      "treatment": [
        "medication to treat the main symptoms of depression and mania when they occur psychological treatment such as talking therapy, which can help you deal with depression, and provides advice about how to improve your relationships"
      ]
    },
    {
      "tag": "bronchiectasis",
      "symptoms": [
        "persistent cough brings phlegm sputum breathlessness"
      ],
      "treatment": [
        "exercises and special devices to help you clear mucus out of your lungs. medication to help improve airflow wit the lungs. antibiotics to treat any lung infecti that develop"
      ]
    },
    {
      "tag": "common_cold",
      "symptoms": [
        "sore throat blocked or runny nose sneezing cough headache"
      ],
      "treatment": [
        "esting, drinking plenty of fluids and eating healthily. taking over-the-counter painkillers, such as paracetamol or ibuprofen, to reduce any fever or discomfort.using decongestant sprays or tablets to relieve a blocked nose.trying remedies such as gargling salt water and sucking on menthol sweets.\n if your symptoms persist for more than three weeks please seek for professional advise"
      ]
    },
    {
      "tag": "constipation",
      "symptoms": [
        "stomach ache and cramps feeling bloated feeling sick loss of appetite gas"
      ],
      "treatment": [
        "Diet and lifestyle changes are usually recommended as the first treatment for constipation.This includes gradually increasing your daily intake of fibre, making sure you drink plenty of fluids, and trying to get more exercise.If these aren't effective, your pharmacist may recommend an oral laxative medication that can help you empty your bowels."
      ]
    },
    {
      "tag": "covid-19",
      "symptoms": [
        "fever dry cough tiredness aches and pains sore throat diarrhoea conjunctivitis headache loss of taste or smell a rash on skin, or discolouration of fingers or toes difficulty breathing or shortness of breath chest pain or pressure loss of speech or movement"
      ],
      "treatment": [
        "Isolate yourself in a well ventilated room.Use a triple layer medical mask, discard mask after 8 hours of use or earlier if they become wet or visibly soiled. In the event of a caregiver entering the room, both caregiver and patient may consider using N 95 mask.Take rest and drink a lot of fluids to maintain adequate hydration.Frequent hand washing with soap and water for at least 40 seconds or clean with alcohol-based sanitizer.\n\n take prescribed doses of vaccine.\n\n STAY HOME, STAY SAFE "
      ]
    },
    {
      "tag": "flu",
      "symptoms": [
        "a high temperature tiredness and weakness a headache general aches and pains a dry chesty cough"
      ],
      "treatment": [
        "Antiviral medication, Antibiotics If you feel unwell and have a fever, you can take paracetamol or anti-inflammatory medicines such as ibuprofen  lower your temperature and relieve aches. Children under 16 shouldn't be given aspirin"
      ]
    },
    {
      "tag": "heart_failure",
      "symptoms": [
        "Breathlessness Tiredness and lethargy Leg swelling Loss of appetite cough and a frothy spit"
      ],
      "treatment": [
        "cpr can help to save the life, call the ambulance as soon as possible."
      ]
    },
    {
      "tag": "kidney_stones",
      "symptoms": [
        "severe pain in the abdomen  urinary tract infection ache in the lower back periods of intense pain in the back or side of your abdomen feeling restless and unable to lie still nausea needing to urinate more often than normal pain when you urinate blood in your urine"
      ],
      "treatment": [
        "Larger stones may need to be broken up using ultrasound or laser energy. Occasionally, keyhole surgery may be needed to remove very large kidney stones directly.visit your Doctor for more info and treatment."
      ]
    },
    {
      "tag": "kidney infection",
      "symptoms": [
        "pain and discomfort in your side lower back or around your genitals high temperature it may reach 39.5C or 103.1F shivering or chills feeling very weak or tired loss of appetite feeling sick or being sick"
      ],
      "treatment": [
        "Antibiotics,Painkillers"
      ]
    },
    {
      "tag": "lyme disease",
      "symptoms": [
        "tiredness fatigue muscle pain joint pain headaches a high temperature fever chills neck stiffnes spain and swelling in the joints nerve problems such as numbness or pain in your limbs memory problems difficulty concentrating heart problems"
      ],
      "treatment": [
        "antibiotics"
      ]
    },
    {
      "tag": "maleria",
      "symptoms": [
        "a high temperature fever headache sweats chills vomiting muscle pains diarrhoea generally feeling unwell"
      ],
      "treatment": [
        "chloroquine phosphate artemisinin based cobinatination therapies"
      ]
    },
    {
      "tag": "nosebleed",
      "symptoms": [
        "continous nose bleeding"
      ],
      "treatment": [
        "sit down and firmly pinch the soft part of your nose just above your nostril for at least 10-15 minutes,lean forward and breathe through your mouth – this will drain blood into your nose instead of down the back of your throat,place an ice pack or bag of frozen vegetables covered by a towel on the bridge of your nose,stay upright rather than lying down as this reduces the blood pressure in the blood vessels of your nose and will discourage further bleeding"
      ]
    },
    {
      "tag": "obesity",
      "symptoms": [
        "difficulty in sleeping back or joint pain excessive sweating intolerance to heat infections in skin folds fatigue depression"
      ],
      "treatment": [
        "exercise on prescription,diet,medication"
      ]
    },
    {
      "tag": "oral thrush in adults",
      "symptoms": [
        "white patches plaques in the mouth that can often be wiped off leaving behind red areas that may bleed slightly loss of taste or an unpleasant taste in the mouth redness inside the mouth and throat cracks at the corners of the mouth a painful burning sensation in the mouth"
      ],
      "treatment": [
        " antifungal medicines"
      ]
    },
    {
      "tag": "panic disorder",
      "symptoms": [
        "a sensation that your heart is beating irregularly palpitations sweating trembling hot flushes chills shortness of breath a choking sensation chest pain nausea dizziness feeling faint numbness or pins and needles dry mouth a need to go to the toilet ringing in your ears a feeling of dread or a fear of dying a churning stomach a tingling sensation in your fingers shivering shaking"
      ],
      "treatment": [
        "cognitive behavioural therapy,support groups,antidepressants,selective serotonin reuptake inhibitors (SSRIs)"
      ]
    },
    {
      "tag": "personality disorder",
      "symptoms": [
        "lack of concern regret or remorse about other people's distress irresponsibility and disregard for normal social behaviour difficulty in sustaining long-term relationships little ability to tolerate frustration and to control their anger lack of guilt or not learning from their mistakes blaming others for problems in their lives"
      ],
      "treatment": [
        "psychological therapie,psychodynamic reflective psychotherapy cognitive behavioural therapy interpersonal therapy therapeutic communities medication"
      ]
    },
    {
      "tag": "sucide",
      "symptoms": [
        "life history mental health lifestyle employment elationships genetics and family history"
      ],
      "treatment": [
        "Talking to someone you trust, kyun acchi khasi jindagi barbaad karne pe tule ho."
      ]
    },
    {
      "tag": "sunburn",
      "symptoms": [
        "skin damage by uv rays blistering or swelling of the skin oedema chills a high temperature fever of 38C 100.4F or above or 37.5C 99.5F or above in children under five dizziness headaches and feeling sick symptoms of heat exhaustion"
      ],
      "treatment": [
        "suitable clothing,sunscreen"
      ]
    },
    {
      "tag": "tuberculosis",
      "symptoms": [
        "lack of appetite and weight loss a high temperature fever night sweats extreme tiredness or fatigue"
      ],
      "treatment": [
        "two antibiotics isoniazid and rifampicin for six months two additional antibiotics pyrazinamide and ethambutol for the first two months"
      ]
    },
    {
      "tag": "tooth decay",
      "symptoms": [
        "toothache either continuous pain keeping you awake or occasional sharp pain without an obvious cause tooth sensitivity you may feel tenderness or pain when eating or drinking something hot cold or sweet grey brown or black spots appearing on your teeth bad breath an unpleasant taste in your mouth"
      ],
      "treatment": [
        "visit your dentist regularly ,cut down on sugary and starchy food and drinks, particularly between meals or within an hour of going to bed,look after your teeth and gums,avoid smoking or drinking alcohol excessively ,see your dentist or GP if you have a persistently dry mouth"
      ]
    },
    {
      "tag": "tonsillitis",
      "symptoms": [
        "high temperature fever over 38C 100.4F coughing headache earache feeling sick feeling tired swollen painful lymph glands in your neck loss of voice or changes to your voice"
      ],
      "treatment": [
        "self-help,antibiotics,surgery,post-operative bleeding"
      ]
    },
    {
      "tag": "thirst",
      "symptoms": [
        "diarrhoea vomiting In some cases thirst may be caused by something as simple as a recent meal or snack Eating salty or spicy foods can cause you to suddenly feel thirsty"
      ],
      "treatment": [
        "If you feel thirsty all the time and have other symptoms, your GP will probably carry out a blood glucose test to see whether you have diabetes."
      ]
    },
    {
      "tag": "tuberculosis (TB)",
      "symptoms": [
        "lack of appetite and weight loss a high temperature fever night sweats extreme tiredness or fatigue "
      ],
      "treatment": [
        "Treatment for tuberculosis (TB) will usually involve a long course of antibiotics lasting several months."
      ]
    },
    {
      "tag": "tooth decay",
      "symptoms": [
        "grey brown or black spots appearing on your teeth bad breath an unpleasant taste in your mouth "
      ],
      "treatment": [
        ""
      ]
    },
    {
      "tag": "tonsillitis",
      "symptoms": [
        "sore throat tonsils will be red and swollen and your throat may be very painful making swallowing difficult high temperature (fever) over 38C (100.4F) coughing headache earache feeling sick "
      ],
      "treatment": [
        "Over the counter painkillers, such as paracetamol and ibuprofen, can help relieve painful symptoms such as a sore throat."
      ]
    },
    {
      "tag": "thrush",
      "symptoms": [
        "itching soreness and redness or fissures like paper cuts around the vagina or anus unusual white discharge from the vagina that may be thick and look like cottage cheese it sometimes smells yeasty pain when peeing or having sex"
      ],
      "treatment": [
        "antifungal cream to apply to the genital area, vaginal pessaries (tablets that you put into your vagina), oral pills or a combination."
      ]
    },
    {
      "tag": "tinnitus",
      "symptoms": [
        "buzzing humming grinding hissing whistling"
      ],
      "treatment": [
        "sound therapy,counselling,cognitive behavioural therapy (CBT),tinnitus retraining therapy (TRT)"
      ]
    },
    {
      "tag": "trichomonas infection",
      "symptoms": [
        "pain or a burning sensation when peeing itching and soreness in the genital area a yellow or green discharge from the vagina or penis which can sometimes have an unpleasant fishy smell"
      ],
      "treatment": [
        "Antibiotics will get rid of the infection."
      ]
    },
    {
      "tag": "ulcerative colitis",
      "symptoms": [
        "recurring diarrhoea which may contain blood mucus or pus abdominal pain needing to empty your bowels frequently"
      ],
      "treatment": [
        "medication such as: aminosalicylates (ASAs), corticosteroids,immunosuppressants"
      ]
    },
    {
      "tag": "underactive thyroid",
      "symptoms": [
        "tiredness being sensitive to cold weight gain constipation depression slow movements and thoughts muscle aches and weakness muscle cramps dry and scaly skin brittle hair and nails irregular periods or heavy periods"
      ],
      "treatment": [
        " treated by taking daily hormone replacement tablets called levothyroxine."
      ]
    },
    {
      "tag": "urticaria (hives)",
      "symptoms": [
        " itchy rash that appears on the skin It may appear on one part of the body or be spread across large areas. "
      ],
      "treatment": [
        "If the itchiness is causing you discomfort antihistamines can help"
      ]
    },
    {
      "tag": "urinary tract infection (UTI)",
      "symptoms": [
        "high temperature fever of 38C 100.4ºF or above pain in your sides or back shivering and chills feeling and being sick confusion agitation or restlessness"
      ],
      "treatment": [
        "Over-the-counter painkillers such as paracetamol can help with any pain. Drinking plenty of fluids may also help you feel better."
      ]
    },
    {
      "tag": "vaginal thrush",
      "symptoms": [
        "itching and soreness around the entrance of the vagina itchy labia pain during sex which may make you worry about having sex a stinging sensation when peeing"
      ],
      "treatment": [
        "Thrush is treated with antifungal medicines that are available as pessaries intravaginal creams or capsules."
      ]
    },
    {
      "tag": "varicose eczema",
      "symptoms": [
        "itchy red and swollen dry and flaky scaly or crusty"
      ],
      "treatment": [
        " long-term treatment with a combination of: emollients (moisturisers),topical corticosteroids,compression stockings"
      ]
    },
    {
      "tag": "varicose veins",
      "symptoms": [
        "aching heavy and uncomfortable legs swollen feet and ankles burning or throbbing in your legs muscle cramp in your legs particularly at night dry itchy and thin skin over the affected vein"
      ],
      "treatment": [
        "taking regular exercise, avoiding standing up for long periods, elevating the affected area when resting"
      ]
    },
    {
      "tag": "venous leg ulcer",
      "symptoms": [
        "a heavy feeling in your legs swollen ankles oedema aching or swelling in your legs red flaky scaly and itchy skin on your legs varicose eczema swollen and enlarged veins on your legs varicose veins an unpleasant and foul smelling discharge from the ulcer"
      ],
      "treatment": [
        "Treatment should always be carried out by a healthcare professional trained in compression therapy for leg ulcers."
      ]
    },
    {
      "tag": "vertigo",
      "symptoms": [
        "loss of balance which can make it difficult to stand or walk feeling sick or being sick dizziness"
      ],
      "treatment": [
        "Medicines such as prochlorperazine and some antihistamines"
      ]
    },
    {
      "tag": " warts and verrucas",
      "symptoms": [
        "Warts are not usually painful but some types such as verrucas may hurt They can occasionally itch or bleed"
      ],
      "treatment": [
        "Treatments include: salicylic acid, cryotherapy, chemical treatments"
      ]
    },
    {
      "tag": "whooping cough",
      "symptoms": [
        "runny nose red and watery eyes a sore throat and a slightly raised temperature."
      ],
      "treatment": [
        "drink lots of fluids clean away mucus and sick from your or your child's mouth and take painkillers such as paracetamol or ibuprofen for a fever."
      ]
    },
    {
      "tag": "yellow fever",
      "symptoms": [
        " high temperature fever a headache nausea or vomiting muscle pain including backache loss of appetite"
      ],
      "treatment": [
        "vaccination"
      ]
    }
  ]
}